# AddingOtherConnectedMembersToSystem Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..SystemsFailures..::..AddingOtherConnectedMembersToSystem Property
BuiltInFailures..::..SystemsFailures Class See Also
---
"You have selected elements that are connected to other elements. These elements will also be added to the System."
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId AddingOtherConnectedMembersToSystem { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property AddingOtherConnectedMembersToSystem As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ AddingOtherConnectedMembersToSystem {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..SystemsFailures Class
Autodesk.Revit.DB Namespace